       IDENTIFICATION DIVISION.
       PROGRAM-ID. VariableFunction.
       DATA DIVISION.
       FILE SECTION.
       WORKING-STORAGE SECTION.
       01  FIRSTVALF PIC 9(9) VALUE ZEROS.
       01  SECONDVAL PIC 9(9) VALUE 2.
       PROCEDURE DIVISION.
       MAIN-PROCEDURE.
           ADD FIRSTVALF TO SECONDVAL
           DISPLAY "first " SECONDVAL.
       END PROGRAM VariableFunction.
